# * correct
sample_1 = "در شرکت اسپارد، قیمت یک سرویس نظافت ۵ ساعته ۲۴ هزار تومان می‌باشد."

sample_3 = "دبیر انجمن تصفیه کنندگان شکر گفت: در شرایط کنونی هر تن شکر ۵۳۰ دلار تحویل بنادر می شود."

sample_4 = "نکته مهم اما در قیمت‌های اعلامی کانال‌های تلگرامی خرید و فروش ارز است؛ در ساعتی که قیمت فروش ارز در کف بازار به ۳۵ هزار و ۸۰۰ تومان رسیده، کانال‌های تلگرامی قیمت فروش دلار را ۳۶ هزار و ۲۰۰ تومان اعلام می‌کنند!"


sample_2 = "به گزارش خبرنگار اقتصادی خبرگزاری تسنیم، هماکنون در بازار آزاد، قیمت طلای ۱۸ عیار هر گرم یک میلیون و ۳۵۹ هزار تومان و قیمت سکه تمام بهار آزادی طرح جدید ۱۵ میلیون و ۱۰۰ هزار تومان است"
sample_2_1 = "قیمت طلای ۱۸ عیار هر گرم یک میلیون و ۳۵۹ هزار تومان و قیمت سکه تمام بهار آزادی طرح جدید ۱۵ میلیون و ۱۰۰ هزار تومان است"

sample_2_4 = "قیمت یک گرم طلای ۱۸ عیار یک میلیون و ۳۵۹ هزار تومان و قیمت سکه تمام بهار آزادی طرح جدید ۱۵ میلیون و ۱۰۰ هزار تومان است"

sample_2_6 = "قیمت یک گرم طلای ۱۸ عیار یک میلیون و ۳۵۹ هزار تومان و قیمت سکه تمام بهار آزادی طرح جدید ۱۵ میلیون و ۱۰۰ هزار تومان"
sample_2_5 = "قیمت یک گرم طلای ۱۸ عیار یک میلیون و ۳۵۹ هزار تومان"
sample_2_2 = "قیمت طلا هر گرم ۳۵۹ هزار تومان و قیمت سکه ۱۰۰ هزار تومان است"
sample_2_3 = "قیمت یک گرم طلا ۳۵۹ هزار تومان و قیمت سکه ۱۰۰ هزار تومان است"
sample_2_7 = "قیمت طلای ۱۸ عیار در بازار آزاد هر گرم هزار تومان است."
sample_2_8 = "قیمت طلای ۱۸ عیار در بازار آزاد به سرعت به هر گرم هزار تومان رسید."
sample_2_8_1 = "طلای ۱۸ عیار در بازار آزاد به سرعت به"


sample_5 = "ولی ما هرکیلو ماکارونی را فقط ۰.۳۵ $ فروخته ایم، در حالی که قیمت جهانی هرکیلو گندم بیش ۰.۴$ است."
sample_5_e = "ولی ما هرکیلو ماکارونی را فقط ۰.۳۵ $ فروخته ایم، در حالی که قیمت جهانی هرکیلو گندم ۰.۴$ است."

sample_7 = "یک کیلو و دویست گرم گندم هزار تومان است."

sample_8 = "سه هندوانه صدهزار تومان میباشد."
sample_8_2 = "قیمت سه هندوانه صدهزار تومان میباشد و هر کیلو طلا دو دلار است."
sample_8_3 = "قیمت سکه سه یورو است و قیمت سه هندوانه صدهزار تومان میباشد و هر کیلو طلا دو دلار است."

sample_12 = "قیمت طلا ده دلار و قیمت موش پایین است."

samples_correct = [
    "ارزش بازار جهانی رمزارزها در حال حاضر ۸۴۰.۹۱ میلیارد دلار است كه ۴.۷۷ درصد رشد را نسبت به روز گذشته نشان می‌دهد. ",
]

# * semicorrect
sample_2_9 = "قیمت طلا هر گرم ۳۵۹ هزار تومان و سکه ۱۰۰ هزار تومان است"
sample_6 = "بیت‌کوین با افت ۱ درصدی به قیمت ۱۶ هزار و ۵۹۸ دلار و اتریوم با کاهش کمتر از ۱ درصد به قیمت هزار و ۲۰۷ دلار معامله می‌شوند."
sample_10 = "نرخ دلار در بازار آزاد در کانال ۳۴ هزار تومان قرار دارد و هم‌اکنون دلار با قیمت حدودی ۳۴هزار و ۹۰۰ تومان فروخته می‌شود."
sample_11 = "گزارش جدید بانک مرکزی از گزیده آمارهای اقتصادی نشان می‌دهد میزان بدهی‌های کوتاه مدت کشور یک میلیارد و ۹۲۴ میلیون دلار و بدهی‌های بلند مدت ایران نیز پنج میلیارد و ۲۳۹ میلیون دلار است."
#: @todo9/Hoseini Split the sentence from the end of the first match and rerun the second part through our extractor.

sample_9 = "قیمت خرید و فروش دلار در صرافی ملی به ترتیب ۳۰ هزار و ۶۴۶ تومان و ۳۰ هزار و ۹۵۴ تومان اعلام شد."

# * evil
samples_evil = [
    "مدیریت امور بین‌الملل شرکت ملی نفت ایران قیمت نفت خام سبک، نفت خام سنگین و فروزان را برای فروش در ماه دسامبر به ترتیب ۵ دلار و ۳۵ سنت، یک دلار و ۸۵ سنت، یک دلار و ۹۵ سنت بالاتر از میانگین قیمت نفت عمان/ دوبی قیمت‌گذاری کرده است.",
    "همزمان با خرید و فروش دلار و یورو آزاد در کانال ۳۶ هزار تومان، بانک مرکزی در قدم اول سراغ راه‌اندازی سامانه برخط بازار متشکل ارزی و ثبت‌نام اینترنتی ارز مسافرتی رفت و در مرحله بعدی شرایط جدیدی برای دریافت ارز مسافرتی اعلام کرده است.",
]

samples = []

# * end
